## Introduction

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName('Dataframe').getOrCreate()

In [3]:
spark

In [4]:
df_pyspark = spark.read.csv('/C:/Users/dell/Desktop/Python/Tableau_DataSet.csv', header=True, inferSchema=True)

In [5]:
df_pyspark.printSchema()

root
 |-- Row ID: integer (nullable = true)
 |-- Order ID: string (nullable = true)
 |-- Order Date: string (nullable = true)
 |-- Ship Date: string (nullable = true)
 |-- Ship Mode: string (nullable = true)
 |-- Customer ID: string (nullable = true)
 |-- Customer Name: string (nullable = true)
 |-- Segment: string (nullable = true)
 |-- Country: string (nullable = true)
 |-- City: string (nullable = true)
 |-- State: string (nullable = true)
 |-- Postal Code: integer (nullable = true)
 |-- Region: string (nullable = true)
 |-- Product ID: string (nullable = true)
 |-- Category: string (nullable = true)
 |-- Sub-Category: string (nullable = true)
 |-- Product Name: string (nullable = true)
 |-- Sales: string (nullable = true)
 |-- Quantity: string (nullable = true)
 |-- Discount: string (nullable = true)
 |-- Profit: double (nullable = true)

In [6]:
df_pyspark.show(5)

+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
|Row ID|      Order ID|Order Date| Ship Date|     Ship Mode|Customer ID|  Customer Name|  Segment|      Country|           City|     State|Postal Code|Region|     Product ID|       Category|Sub-Category|        Product Name|   Sales|Quantity|Discount|  Profit|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
|     1|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-BO-10001798|      Furniture|   Bookcases|Bush Somerset Col...|  261.96|       2|       0| 41.9136|
|     2|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-CH-10000454|      Furniture|      Chairs|Hon Deluxe Fabric...|  731.94|       3|       0| 219.582|
|     3|CA-2016-138688|12-06-2016|16-06-2016|  Second Class|   DV-13045|Darrin Van Huff|Corporate|United States|    Los Angeles|California|      90036|  West|OFF-LA-10000240|Office Supplies|      Labels|Self-Adhesive Add...|   14.62|       2|       0|  6.8714|
|     4|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|FUR-TA-10000577|      Furniture|      Tables|Bretford CR4500 S...|957.5775|       5|    0.45|-383.031|
|     5|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|OFF-ST-10000760|Office Supplies|     Storage|Eldon Fold 'N Rol...|  22.368|       2|     0.2|  2.5164|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
only showing top 5 rows

In [7]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [8]:
df_pyspark.columns

['Row ID',
 'Order ID',
 'Order Date',
 'Ship Date',
 'Ship Mode',
 'Customer ID',
 'Customer Name',
 'Segment',
 'Country',
 'City',
 'State',
 'Postal Code',
 'Region',
 'Product ID',
 'Category',
 'Sub-Category',
 'Product Name',
 'Sales',
 'Quantity',
 'Discount',
 'Profit']

In [9]:
df_pyspark.head(5)

[Row(Row ID=1, Order ID='CA-2016-152156', Order Date='08-11-2016', Ship Date='11-11-2016', Ship Mode='Second Class', Customer ID='CG-12520', Customer Name='Claire Gute', Segment='Consumer', Country='United States', City='Henderson', State='Kentucky', Postal Code=42420, Region='South', Product ID='FUR-BO-10001798', Category='Furniture', Sub-Category='Bookcases', Product Name='Bush Somerset Collection Bookcase', Sales='261.96', Quantity='2', Discount='0', Profit=41.9136),
 Row(Row ID=2, Order ID='CA-2016-152156', Order Date='08-11-2016', Ship Date='11-11-2016', Ship Mode='Second Class', Customer ID='CG-12520', Customer Name='Claire Gute', Segment='Consumer', Country='United States', City='Henderson', State='Kentucky', Postal Code=42420, Region='South', Product ID='FUR-CH-10000454', Category='Furniture', Sub-Category='Chairs', Product Name='Hon Deluxe Fabric Upholstered Stacking Chairs, Rounded Back', Sales='731.94', Quantity='3', Discount='0', Profit=219.582),
 Row(Row ID=3, Order ID='CA-2016-138688', Order Date='12-06-2016', Ship Date='16-06-2016', Ship Mode='Second Class', Customer ID='DV-13045', Customer Name='Darrin Van Huff', Segment='Corporate', Country='United States', City='Los Angeles', State='California', Postal Code=90036, Region='West', Product ID='OFF-LA-10000240', Category='Office Supplies', Sub-Category='Labels', Product Name='Self-Adhesive Address Labels for Typewriters by Universal', Sales='14.62', Quantity='2', Discount='0', Profit=6.8714),
 Row(Row ID=4, Order ID='US-2015-108966', Order Date='11-10-2015', Ship Date='18-10-2015', Ship Mode='Standard Class', Customer ID='SO-20335', Customer Name="Sean O'Donnell", Segment='Consumer', Country='United States', City='Fort Lauderdale', State='Florida', Postal Code=33311, Region='South', Product ID='FUR-TA-10000577', Category='Furniture', Sub-Category='Tables', Product Name='Bretford CR4500 Series Slim Rectangular Table', Sales='957.5775', Quantity='5', Discount='0.45', Profit=-383.031),
 Row(Row ID=5, Order ID='US-2015-108966', Order Date='11-10-2015', Ship Date='18-10-2015', Ship Mode='Standard Class', Customer ID='SO-20335', Customer Name="Sean O'Donnell", Segment='Consumer', Country='United States', City='Fort Lauderdale', State='Florida', Postal Code=33311, Region='South', Product ID='OFF-ST-10000760', Category='Office Supplies', Sub-Category='Storage', Product Name="Eldon Fold 'N Roll Cart System", Sales='22.368', Quantity='2', Discount='0.2', Profit=2.5164)]

In [10]:
df_pyspark.select('Customer Name').show()

+------------------+
|     Customer Name|
+------------------+
|       Claire Gute|
|       Claire Gute|
|   Darrin Van Huff|
|    Sean O'Donnell|
|    Sean O'Donnell|
|   Brosina Hoffman|
|   Brosina Hoffman|
|   Brosina Hoffman|
|   Brosina Hoffman|
|   Brosina Hoffman|
|   Brosina Hoffman|
|   Brosina Hoffman|
|      Andrew Allen|
|      Irene Maddox|
|     Harold Pawlan|
|     Harold Pawlan|
|         Pete Kriz|
|   Alejandro Grove|
|Zuschuss Donatelli|
|Zuschuss Donatelli|
+------------------+
only showing top 20 rows

In [11]:
df_pyspark.select(['Customer ID', 'Customer Name']).show()

+-----------+------------------+
|Customer ID|     Customer Name|
+-----------+------------------+
|   CG-12520|       Claire Gute|
|   CG-12520|       Claire Gute|
|   DV-13045|   Darrin Van Huff|
|   SO-20335|    Sean O'Donnell|
|   SO-20335|    Sean O'Donnell|
|   BH-11710|   Brosina Hoffman|
|   BH-11710|   Brosina Hoffman|
|   BH-11710|   Brosina Hoffman|
|   BH-11710|   Brosina Hoffman|
|   BH-11710|   Brosina Hoffman|
|   BH-11710|   Brosina Hoffman|
|   BH-11710|   Brosina Hoffman|
|   AA-10480|      Andrew Allen|
|   IM-15070|      Irene Maddox|
|   HP-14815|     Harold Pawlan|
|   HP-14815|     Harold Pawlan|
|   PK-19075|         Pete Kriz|
|   AG-10270|   Alejandro Grove|
|   ZD-21925|Zuschuss Donatelli|
|   ZD-21925|Zuschuss Donatelli|
+-----------+------------------+
only showing top 20 rows

In [12]:
df_pyspark.dtypes

[('Row ID', 'int'),
 ('Order ID', 'string'),
 ('Order Date', 'string'),
 ('Ship Date', 'string'),
 ('Ship Mode', 'string'),
 ('Customer ID', 'string'),
 ('Customer Name', 'string'),
 ('Segment', 'string'),
 ('Country', 'string'),
 ('City', 'string'),
 ('State', 'string'),
 ('Postal Code', 'int'),
 ('Region', 'string'),
 ('Product ID', 'string'),
 ('Category', 'string'),
 ('Sub-Category', 'string'),
 ('Product Name', 'string'),
 ('Sales', 'string'),
 ('Quantity', 'string'),
 ('Discount', 'string'),
 ('Profit', 'double')]

In [13]:
df_pyspark.describe().show()

+-------+------------------+--------------+----------+----------+--------------+-----------+------------------+-----------+-------------+--------+-------+------------------+-------+---------------+----------+------------+--------------------+------------------+------------------+------------------+------------------+
|summary|            Row ID|      Order ID|Order Date| Ship Date|     Ship Mode|Customer ID|     Customer Name|    Segment|      Country|    City|  State|       Postal Code| Region|     Product ID|  Category|Sub-Category|        Product Name|             Sales|          Quantity|          Discount|            Profit|
+-------+------------------+--------------+----------+----------+--------------+-----------+------------------+-----------+-------------+--------+-------+------------------+-------+---------------+----------+------------+--------------------+------------------+------------------+------------------+------------------+
|  count|              9994|          9994|      9994|      9994|          9994|       9994|              9994|       9994|         9994|    9994|   9994|              9994|   9994|           9994|      9994|        9994|                9994|              9994|              9994|              9994|              9994|
|   mean|            4997.5|          null|      null|      null|          null|       null|              null|       null|         null|    null|   null|  55190.3794276566|   null|           null|      null|        null|                null|234.41818199917006| 5.828590535392018|0.3155949113492862|28.587912967780834|
| stddev|2885.1636290974325|          null|      null|      null|          null|       null|              null|       null|         null|    null|   null|32063.693350364487|   null|           null|      null|        null|                null| 631.7890112674363|25.520975563736403| 3.314008629792499| 234.3891156047269|
|    min|                 1|CA-2014-100006|01-01-2017|01-01-2015|   First Class|   AA-10315|     Aaron Bergman|   Consumer|United States|Aberdeen|Alabama|              1040|Central|FUR-BO-10000112| Furniture| Accessories|"""While you Were...|          10/Pack"|      1040 sheets"|           30/Box"|         -6599.978|
|    max|              9994|US-2017-169551|31-12-2016|31-12-2017|Standard Class|   ZD-21925|Zuschuss Donatelli|Home Office|United States|    Yuma|Wyoming|             99301|   West|TEC-PH-10004977|Technology|      Tables|netTALK DUO VoIP ...|            999.98|            98.352|            98.352|          8399.976|
+-------+------------------+--------------+----------+----------+--------------+-----------+------------------+-----------+-------------+--------+-------+------------------+-------+---------------+----------+------------+--------------------+------------------+------------------+------------------+------------------+

In [14]:
df_pyspark = df_pyspark.withColumn('New Discount', df_pyspark['Discount'] + 0.1)

In [15]:
df_pyspark.show(5)

+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+-------------------+
|Row ID|      Order ID|Order Date| Ship Date|     Ship Mode|Customer ID|  Customer Name|  Segment|      Country|           City|     State|Postal Code|Region|     Product ID|       Category|Sub-Category|        Product Name|   Sales|Quantity|Discount|  Profit|       New Discount|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+-------------------+
|     1|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-BO-10001798|      Furniture|   Bookcases|Bush Somerset Col...|  261.96|       2|       0| 41.9136|                0.1|
|     2|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-CH-10000454|      Furniture|      Chairs|Hon Deluxe Fabric...|  731.94|       3|       0| 219.582|                0.1|
|     3|CA-2016-138688|12-06-2016|16-06-2016|  Second Class|   DV-13045|Darrin Van Huff|Corporate|United States|    Los Angeles|California|      90036|  West|OFF-LA-10000240|Office Supplies|      Labels|Self-Adhesive Add...|   14.62|       2|       0|  6.8714|                0.1|
|     4|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|FUR-TA-10000577|      Furniture|      Tables|Bretford CR4500 S...|957.5775|       5|    0.45|-383.031|               0.55|
|     5|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|OFF-ST-10000760|Office Supplies|     Storage|Eldon Fold 'N Rol...|  22.368|       2|     0.2|  2.5164|0.30000000000000004|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+-------------------+
only showing top 5 rows

In [16]:
df_pyspark = df_pyspark.drop('New Discount')

In [17]:
df_pyspark.show(5)

+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
|Row ID|      Order ID|Order Date| Ship Date|     Ship Mode|Customer ID|  Customer Name|  Segment|      Country|           City|     State|Postal Code|Region|     Product ID|       Category|Sub-Category|        Product Name|   Sales|Quantity|Discount|  Profit|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
|     1|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-BO-10001798|      Furniture|   Bookcases|Bush Somerset Col...|  261.96|       2|       0| 41.9136|
|     2|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-CH-10000454|      Furniture|      Chairs|Hon Deluxe Fabric...|  731.94|       3|       0| 219.582|
|     3|CA-2016-138688|12-06-2016|16-06-2016|  Second Class|   DV-13045|Darrin Van Huff|Corporate|United States|    Los Angeles|California|      90036|  West|OFF-LA-10000240|Office Supplies|      Labels|Self-Adhesive Add...|   14.62|       2|       0|  6.8714|
|     4|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|FUR-TA-10000577|      Furniture|      Tables|Bretford CR4500 S...|957.5775|       5|    0.45|-383.031|
|     5|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|OFF-ST-10000760|Office Supplies|     Storage|Eldon Fold 'N Rol...|  22.368|       2|     0.2|  2.5164|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
only showing top 5 rows

In [18]:
df_pyspark = df_pyspark.withColumnRenamed('Order ID', 'Order Number')

In [19]:
df_pyspark.show(5)

+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
|Row ID|  Order Number|Order Date| Ship Date|     Ship Mode|Customer ID|  Customer Name|  Segment|      Country|           City|     State|Postal Code|Region|     Product ID|       Category|Sub-Category|        Product Name|   Sales|Quantity|Discount|  Profit|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
|     1|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-BO-10001798|      Furniture|   Bookcases|Bush Somerset Col...|  261.96|       2|       0| 41.9136|
|     2|CA-2016-152156|08-11-2016|11-11-2016|  Second Class|   CG-12520|    Claire Gute| Consumer|United States|      Henderson|  Kentucky|      42420| South|FUR-CH-10000454|      Furniture|      Chairs|Hon Deluxe Fabric...|  731.94|       3|       0| 219.582|
|     3|CA-2016-138688|12-06-2016|16-06-2016|  Second Class|   DV-13045|Darrin Van Huff|Corporate|United States|    Los Angeles|California|      90036|  West|OFF-LA-10000240|Office Supplies|      Labels|Self-Adhesive Add...|   14.62|       2|       0|  6.8714|
|     4|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|FUR-TA-10000577|      Furniture|      Tables|Bretford CR4500 S...|957.5775|       5|    0.45|-383.031|
|     5|US-2015-108966|11-10-2015|18-10-2015|Standard Class|   SO-20335| Sean O'Donnell| Consumer|United States|Fort Lauderdale|   Florida|      33311| South|OFF-ST-10000760|Office Supplies|     Storage|Eldon Fold 'N Rol...|  22.368|       2|     0.2|  2.5164|
+------+--------------+----------+----------+--------------+-----------+---------------+---------+-------------+---------------+----------+-----------+------+---------------+---------------+------------+--------------------+--------+--------+--------+--------+
only showing top 5 rows

## Handling the Dataframe

In [20]:
df_pyspark_test = spark.read.csv('test.csv', header=True, inferSchema=True)

In [21]:
df_pyspark_test.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [22]:
df_pyspark_test.show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
|Bipasha|  32|      null| 34000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|   null|  34|         8| 54000|
|Supriya|  27|      null| 32000|
|  Raina|  29|         2|  null|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   null|  34|        10| 38000|
|   null|  56|      null|  null|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [23]:
df_pyspark_test.drop('Salary').show()

+-------+----+----------+
|   Name| Age|Experience|
+-------+----+----------+
|Vaibhav|  23|         3|
|  Ankit|  20|         9|
|Bipasha|  32|      null|
| Chetan|null|         8|
|Diwakar|  21|         5|
|   null|  34|         8|
|Supriya|  27|      null|
|  Raina|  29|         2|
|  Neetu|  40|         3|
|  Aryan|  32|         5|
|   null|  34|        10|
|   null|  56|      null|
|   Ritu|  31|         6|
|  Priya|  25|         5|
| Yogita|  28|         3|
| Snehal|  24|         6|
|  Rohan|  27|         5|
+-------+----+----------+

In [24]:
df_pyspark_test.na.drop().show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Ankit| 20|         9| 20000|
|Diwakar| 21|         5| 23000|
|  Neetu| 40|         3| 50000|
|  Aryan| 32|         5| 45000|
|   Ritu| 31|         6| 25000|
|  Priya| 25|         5| 24000|
| Yogita| 28|         3| 42000|
| Snehal| 24|         6| 26000|
|  Rohan| 27|         5| 52000|
+-------+---+----------+------+

In [25]:
df_pyspark_test.na.drop(how = 'any').show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Ankit| 20|         9| 20000|
|Diwakar| 21|         5| 23000|
|  Neetu| 40|         3| 50000|
|  Aryan| 32|         5| 45000|
|   Ritu| 31|         6| 25000|
|  Priya| 25|         5| 24000|
| Yogita| 28|         3| 42000|
| Snehal| 24|         6| 26000|
|  Rohan| 27|         5| 52000|
+-------+---+----------+------+

In [26]:
df_pyspark_test.na.drop(how = 'all').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
|Bipasha|  32|      null| 34000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|   null|  34|         8| 54000|
|Supriya|  27|      null| 32000|
|  Raina|  29|         2|  null|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   null|  34|        10| 38000|
|   null|  56|      null|  null|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [27]:
df_pyspark_test.na.drop(thresh = 2).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
|Bipasha|  32|      null| 34000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|   null|  34|         8| 54000|
|Supriya|  27|      null| 32000|
|  Raina|  29|         2|  null|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   null|  34|        10| 38000|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [28]:
df_pyspark_test.na.drop(thresh = 3).show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
|Bipasha|  32|      null| 34000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|   null|  34|         8| 54000|
|Supriya|  27|      null| 32000|
|  Raina|  29|         2|  null|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   null|  34|        10| 38000|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [29]:
df_pyspark_test.na.drop(subset = 'Name').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
|Bipasha|  32|      null| 34000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|Supriya|  27|      null| 32000|
|  Raina|  29|         2|  null|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [30]:
df_pyspark_test.na.drop(subset = 'Experience').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|   null|  34|         8| 54000|
|  Raina|  29|         2|  null|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   null|  34|        10| 38000|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [31]:
df_pyspark_test.na.fill('Not Available').show()

# age,experience,salary are int type so not getting filled with string 'not available'

+-------------+----+----------+------+
|         Name| Age|Experience|Salary|
+-------------+----+----------+------+
|      Vaibhav|  23|         3| 10000|
|        Ankit|  20|         9| 20000|
|      Bipasha|  32|      null| 34000|
|       Chetan|null|         8| 54440|
|      Diwakar|  21|         5| 23000|
|Not Available|  34|         8| 54000|
|      Supriya|  27|      null| 32000|
|        Raina|  29|         2|  null|
|        Neetu|  40|         3| 50000|
|        Aryan|  32|         5| 45000|
|Not Available|  34|        10| 38000|
|Not Available|  56|      null|  null|
|         Ritu|  31|         6| 25000|
|        Priya|  25|         5| 24000|
|       Yogita|  28|         3| 42000|
|       Snehal|  24|         6| 26000|
|        Rohan|  27|         5| 52000|
+-------------+----+----------+------+

In [32]:
df_pyspark_test.na.fill(0, subset = ['Salary', 'Experience', 'Age']).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Ankit| 20|         9| 20000|
|Bipasha| 32|         0| 34000|
| Chetan|  0|         8| 54440|
|Diwakar| 21|         5| 23000|
|   null| 34|         8| 54000|
|Supriya| 27|         0| 32000|
|  Raina| 29|         2|     0|
|  Neetu| 40|         3| 50000|
|  Aryan| 32|         5| 45000|
|   null| 34|        10| 38000|
|   null| 56|         0|     0|
|   Ritu| 31|         6| 25000|
|  Priya| 25|         5| 24000|
| Yogita| 28|         3| 42000|
| Snehal| 24|         6| 26000|
|  Rohan| 27|         5| 52000|
+-------+---+----------+------+

In [33]:
df_pyspark_test.describe().show()

+-------+------+-----------------+------------------+------------------+
|summary|  Name|              Age|        Experience|            Salary|
+-------+------+-----------------+------------------+------------------+
|  count|    14|               16|                14|                15|
|   mean|  null|          30.1875| 5.571428571428571|           35296.0|
| stddev|  null|8.681157756889343|2.4405007592795287|13927.360943737434|
|    min| Ankit|               20|                 2|             10000|
|    max|Yogita|               56|                10|             54440|
+-------+------+-----------------+------------------+------------------+

In [34]:
df_pyspark_test.na.fill(31, subset = 'Age').show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Ankit| 20|         9| 20000|
|Bipasha| 32|      null| 34000|
| Chetan| 31|         8| 54440|
|Diwakar| 21|         5| 23000|
|   null| 34|         8| 54000|
|Supriya| 27|      null| 32000|
|  Raina| 29|         2|  null|
|  Neetu| 40|         3| 50000|
|  Aryan| 32|         5| 45000|
|   null| 34|        10| 38000|
|   null| 56|      null|  null|
|   Ritu| 31|         6| 25000|
|  Priya| 25|         5| 24000|
| Yogita| 28|         3| 42000|
| Snehal| 24|         6| 26000|
|  Rohan| 27|         5| 52000|
+-------+---+----------+------+

In [35]:
df_pyspark_test.na.fill(5, subset = 'Experience').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
|Bipasha|  32|         5| 34000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|   null|  34|         8| 54000|
|Supriya|  27|         5| 32000|
|  Raina|  29|         2|  null|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   null|  34|        10| 38000|
|   null|  56|         5|  null|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [36]:
df_pyspark_test.na.fill(36044, subset = 'Salary').show()

+-------+----+----------+------+
|   Name| Age|Experience|Salary|
+-------+----+----------+------+
|Vaibhav|  23|         3| 10000|
|  Ankit|  20|         9| 20000|
|Bipasha|  32|      null| 34000|
| Chetan|null|         8| 54440|
|Diwakar|  21|         5| 23000|
|   null|  34|         8| 54000|
|Supriya|  27|      null| 32000|
|  Raina|  29|         2| 36044|
|  Neetu|  40|         3| 50000|
|  Aryan|  32|         5| 45000|
|   null|  34|        10| 38000|
|   null|  56|      null| 36044|
|   Ritu|  31|         6| 25000|
|  Priya|  25|         5| 24000|
| Yogita|  28|         3| 42000|
| Snehal|  24|         6| 26000|
|  Rohan|  27|         5| 52000|
+-------+----+----------+------+

In [37]:
# IMPUTER FUNCTION

from pyspark.ml.feature import Imputer

imputer = Imputer(
                  inputCols = ['Age', 'Experience', 'Salary'],
                  outputCols = [f'{c}_imputed' for c in ['Age', 'Experience', 'Salary']]
                 ).setStrategy('mean')

# put median in .setStrategy('median') to replace the null values with median values

In [38]:
imputer.fit(df_pyspark_test).transform(df_pyspark_test).show()

+-------+----+----------+------+-----------+------------------+--------------+
|   Name| Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+-------+----+----------+------+-----------+------------------+--------------+
|Vaibhav|  23|         3| 10000|         23|                 3|         10000|
|  Ankit|  20|         9| 20000|         20|                 9|         20000|
|Bipasha|  32|      null| 34000|         32|                 5|         34000|
| Chetan|null|         8| 54440|         30|                 8|         54440|
|Diwakar|  21|         5| 23000|         21|                 5|         23000|
|   null|  34|         8| 54000|         34|                 8|         54000|
|Supriya|  27|      null| 32000|         27|                 5|         32000|
|  Raina|  29|         2|  null|         29|                 2|         35296|
|  Neetu|  40|         3| 50000|         40|                 3|         50000|
|  Aryan|  32|         5| 45000|         32|                 5|         45000|
|   null|  34|        10| 38000|         34|                10|         38000|
|   null|  56|      null|  null|         56|                 5|         35296|
|   Ritu|  31|         6| 25000|         31|                 6|         25000|
|  Priya|  25|         5| 24000|         25|                 5|         24000|
| Yogita|  28|         3| 42000|         28|                 3|         42000|
| Snehal|  24|         6| 26000|         24|                 6|         26000|
|  Rohan|  27|         5| 52000|         27|                 5|         52000|
+-------+----+----------+------+-----------+------------------+--------------+

## Filtering the Data

In [39]:
df_pyspark_test = df_pyspark_test.na.drop()

In [40]:
df_pyspark_test.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [41]:
df_pyspark_test.show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Ankit| 20|         9| 20000|
|Diwakar| 21|         5| 23000|
|  Neetu| 40|         3| 50000|
|  Aryan| 32|         5| 45000|
|   Ritu| 31|         6| 25000|
|  Priya| 25|         5| 24000|
| Yogita| 28|         3| 42000|
| Snehal| 24|         6| 26000|
|  Rohan| 27|         5| 52000|
+-------+---+----------+------+

In [42]:
df_pyspark_test.filter('Salary >= 30000').show()

+------+---+----------+------+
|  Name|Age|Experience|Salary|
+------+---+----------+------+
| Neetu| 40|         3| 50000|
| Aryan| 32|         5| 45000|
|Yogita| 28|         3| 42000|
| Rohan| 27|         5| 52000|
+------+---+----------+------+

In [43]:
df_pyspark_test.filter('Salary <= 30000').select(['Name', 'Age']).show()

+-------+---+
|   Name|Age|
+-------+---+
|Vaibhav| 23|
|  Ankit| 20|
|Diwakar| 21|
|   Ritu| 31|
|  Priya| 25|
| Snehal| 24|
+-------+---+

In [44]:
df_pyspark_test.filter(df_pyspark_test['Salary'] <= 30000).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Ankit| 20|         9| 20000|
|Diwakar| 21|         5| 23000|
|   Ritu| 31|         6| 25000|
|  Priya| 25|         5| 24000|
| Snehal| 24|         6| 26000|
+-------+---+----------+------+

In [45]:
df_pyspark_test.filter((df_pyspark_test['Salary'] >= 20000) & 
                       (df_pyspark_test["Age"] <= 30)).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|  Ankit| 20|         9| 20000|
|Diwakar| 21|         5| 23000|
|  Priya| 25|         5| 24000|
| Yogita| 28|         3| 42000|
| Snehal| 24|         6| 26000|
|  Rohan| 27|         5| 52000|
+-------+---+----------+------+

In [46]:
df_pyspark_test.filter((df_pyspark_test['Salary'] >= 20000) | 
                       (df_pyspark_test["Age"] <= 30)).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Ankit| 20|         9| 20000|
|Diwakar| 21|         5| 23000|
|  Neetu| 40|         3| 50000|
|  Aryan| 32|         5| 45000|
|   Ritu| 31|         6| 25000|
|  Priya| 25|         5| 24000|
| Yogita| 28|         3| 42000|
| Snehal| 24|         6| 26000|
|  Rohan| 27|         5| 52000|
+-------+---+----------+------+

In [47]:
df_pyspark_test.filter(~((df_pyspark_test['Salary'] >= 20000) & 
                       (df_pyspark_test["Age"] <= 30))).show()

+-------+---+----------+------+
|   Name|Age|Experience|Salary|
+-------+---+----------+------+
|Vaibhav| 23|         3| 10000|
|  Neetu| 40|         3| 50000|
|  Aryan| 32|         5| 45000|
|   Ritu| 31|         6| 25000|
+-------+---+----------+------+

## Groupby & Aggregate Functions

In [48]:
df_pyspark_test1 = spark.read.csv('test1.csv', header=True, inferSchema=True)

In [49]:
df_pyspark_test1.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Department: string (nullable = true)
 |-- Salary: integer (nullable = true)

In [50]:
df_pyspark_test1.show()

+------+------------+------+
|  Name|  Department|Salary|
+------+------------+------+
| Arjun|Data Science| 10000|
| Richa|         IOT|  5000|
| Soham|Data Science|  4500|
| Arjun|    Big Data| 12000|
| Arjun|         IOT| 14000|
| Soham|    Big Data|  9000|
|Neeraj|         IOT|  7000|
| Richa|Data Science|  2300|
| Parth|    Big Data|  5000|
| Parth|         IOT| 11000|
|Bhavya|Data Science|  6500|
+------+------------+------+

In [51]:
df_pyspark_test1.groupBy('Name').sum('Salary').show()

+------+-----------+
|  Name|sum(Salary)|
+------+-----------+
| Soham|      13500|
| Richa|       7300|
|Neeraj|       7000|
| Parth|      16000|
|Bhavya|       6500|
| Arjun|      36000|
+------+-----------+

In [52]:
df_pyspark_test1.groupBy('Department').avg('Salary').show()

+------------+-----------------+
|  Department|      avg(Salary)|
+------------+-----------------+
|         IOT|           9250.0|
|    Big Data|8666.666666666666|
|Data Science|           5825.0|
+------------+-----------------+

In [53]:
df_pyspark_test1.groupBy('Department').max('Salary').show()

+------------+-----------+
|  Department|max(Salary)|
+------------+-----------+
|         IOT|      14000|
|    Big Data|      12000|
|Data Science|      10000|
+------------+-----------+

In [54]:
df_pyspark_test1.groupBy('Department').min('Salary').show()

+------------+-----------+
|  Department|min(Salary)|
+------------+-----------+
|         IOT|       5000|
|    Big Data|       5000|
|Data Science|       2300|
+------------+-----------+

In [55]:
df_pyspark_test1.groupBy('Department').count().show()

+------------+-----+
|  Department|count|
+------------+-----+
|         IOT|    4|
|    Big Data|    3|
|Data Science|    4|
+------------+-----+

In [56]:
df_pyspark_test1.agg({'Salary' : 'sum'}).show()

+-----------+
|sum(Salary)|
+-----------+
|      86300|
+-----------+

In [57]:
df_pyspark_test1.agg({'Salary' : 'avg'}).show()

+-----------------+
|      avg(Salary)|
+-----------------+
|7845.454545454545|
+-----------------+

In [58]:
df_pyspark_test1.agg({'Salary' : 'max'}).show()

+-----------+
|max(Salary)|
+-----------+
|      14000|
+-----------+

In [59]:
df_pyspark_test1.agg({'Salary' : 'min'}).show()

+-----------+
|min(Salary)|
+-----------+
|       2300|
+-----------+